Tekla Open API Reference for Tekla Structures 2025
ShapeItem.SetMetadata Method
 Set the Shape item's metadata. Inserts the metadata if key is not found, otherwise modifies existing data.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetMetadata(
	string key,
	ShapeMetadataTypeEnum type,
	Object value,
	string label,
	string description
)
Public Function SetMetadata (
	key As String,
	type As ShapeMetadataTypeEnum,
	value As Object,
	label As String,
	description As String
) As Boolean
Parameters
key
Type: System.String
The key of metadata.
type
Type: Tekla.Structures.Catalogs.ShapeMetadataTypeEnum
The type of metadata.
value
Type: System.Object
The value of metadata.
label
Type: System.String
The label of metadata.
description
Type: System.String
The description of metadata.
Return Value
Type: Boolean
True if success or False
Examples
public void SetMetadataTest()
{
    var polymesh = CreateSomeValidBrep();
    var shapeItem = new ShapeItem
    {
        Name = "TestFileName",
        ShapeFacetedBrep = polymesh,
        UpAxis = ShapeUpAxis.Z_Axis
    };
    shapeItem.Insert();
    shapeItem.SetMetadata("test", ShapeMetadataTypeEnum.Text, "testvalue", "", "");
}
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace